# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [7]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("data.sqlite")
c = conn.cursor()

In [8]:
def display_table(statement):
    c.execute(statement)
    df = pd.DataFrame(c.fetchall())
    df.columns = [i[0] for i in c.description]
    return df.head()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [9]:
statement = """SELECT firstName, lastName, city, state 
                        FROM employees
                        JOIN offices
                        USING(officeCode)"""

display_table(statement)

  firstName   lastName           city state
0     Diane     Murphy  San Francisco    CA
1      Mary  Patterson  San Francisco    CA
2      Jeff   Firrelli  San Francisco    CA
3   William  Patterson         Sydney
4    Gerard     Bondur          Paris

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [14]:
statement = """SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
                        FROM orders
                        JOIN customers
                        USING(customerNumber)"""

display_table(statement)

  contactFirstName contactLastName orderNumber   orderDate   status
0          Dorothy           Young       10100  2003-01-06  Shipped
1           Roland          Keitel       10101  2003-01-09  Shipped
2          Michael           Frick       10102  2003-01-10  Shipped
3           Jonas       Bergulfsen       10103  2003-01-29  Shipped
4           Diego           Freyre       10104  2003-01-31  Shipped

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [15]:


statement = """SELECT contactFirstName, contactLastName, amount, paymentDate
                        FROM payments
                        JOIN customers
                        USING(customerNumber)"""

display_table(statement)

  contactFirstName contactLastName    amount paymentDate
0          Carine          Schmitt   6066.78  2004-10-19
1          Carine          Schmitt  14571.44  2003-06-05
2          Carine          Schmitt   1676.14  2004-12-18
3             Jean            King  14191.12  2004-12-17
4             Jean            King  32641.98  2003-06-06

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [4]:
statement = """SELECT contactFirstName, quantityOrdered, productName, orderDate
                        FROM customers
                        JOIN orders
                        USING(customerNumber)
                        JOIN orderdetails
                        USING(orderNumber)
                        JOIN products
                        USING(productC)"""

display_table(statement)

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!